class T:
    FOOD_RECIPE = """
Назва страви: <b>{name}</b>\n
{ingredients}\n
<i>{description}</i>
"""
    COCKTAIL_RECIPES = """
Назва коктейлю: <b>{name}</b>\n
{ingredients}\n
<i>{description}</i>
"""
    SWEETS_RECIPE = """
Назва солодкого: <b>{name}</b>\n
{ingredients}\n
<i>{description}</i>  
"""
    RECIPE_STEP = """
👩‍🍳 Крок {step}/{max_step} :\n
<i>{text}</i>
"""
    ZODIAC = """
<b>{title}</b>\n\n
<i>{text}</i>
"""
    MatrixOfDestinyPersonal = """
Знизу напиши будь-ласка ім'я та дату народження в форматі : \n   
----------------
Олег 01.04.2006
----------------
Ім'я дд.мм.рррр
----------------
Віка 10.08.2007
----------------\n
<i>Тоб-то просто через пробіл ім'я та дата народження, без ком і тд.</i> 
"""
    MatrixOfDestinyChoiceSex = """
<b>Обери стать для перевірки ⬇️</b> 
"""
    MatrixOfDestinyCompatibility = """
Знизу напиши будь-ласка ім'я та дату народження в форматі : \n   
----------------
Олег 01.04.2006
Віка 10.08.2007
----------------
Ім'я дд.мм.рррр
Ім'я дд.мм.рррр
----------------
Віка 10.08.2007
Олег 01.04.2006
----------------\n
<i>Тоб-то просто через пробіл ім'я та дата народження, потім через перенос абзацу ім'я та дата народження, без ком і тд.</i> 
"""