class T:
    ErrorMessage = "😥 Вибач, сталася помилка. Спробуй ще раз."
    
    FOOD_RECIPE = """
Назва страви: <b>{name}</b>\n
{ingredients}\n
<i>{description}</i>
"""
    COCKTAIL_RECIPES = """
Назва коктейлю: <b>{name}</b>\n
{ingredients}\n
<i>{description}</i>
"""
    SWEETS_RECIPE = """
Назва солодкого: <b>{name}</b>\n
{ingredients}\n
<i>{description}</i>  
"""
    RECIPE_STEP = """
👩‍🍳 Крок {step}/{max_step} :\n
<i>{text}</i>
"""
    ZODIAC = """
<b>{title}</b>\n\n
<i>{text}</i>
"""
    MatrixOfDestinyPersonal = """
Знизу напиши будь-ласка ім'я та дату народження в форматі : \n   
----------------
Олег 01.04.2006
----------------
Ім'я дд.мм.рррр
----------------
Віка 10.08.2007
----------------\n
<i>Тоб-то просто через пробіл ім'я та дата народження, без ком і тд.</i> 
"""
    MatrixOfDestinyChoiceSex = """
<b>Обери стать для перевірки ⬇️</b> 
"""
    MatrixOfDestinyCompatibility = """
Знизу напиши будь-ласка ім'я та дату народження в форматі : \n   
----------------
Олег 01.04.2006
Віка 10.08.2007
----------------
Ім'я дд.мм.рррр
Ім'я дд.мм.рррр
----------------
Віка 10.08.2007
Олег 01.04.2006
----------------\n
<i>Тоб-то просто через пробіл ім'я та дата народження, потім через перенос абзацу ім'я та дата народження, без ком і тд.</i> 
"""
    DailyReminder = """
<b>Приклади:</b>\n
Текст…\n11:11  (щодня о 11:11)
Текст…\n12:12 (щодня о 12:12)
"""
    OneReminder = """
<b>Приклади:</b>\n
Текст…\n04.09 11:11  (4 вересня о 11:11)
Текст…\n04.04.2024 11:11 (4 вересня 2024 року о 11:11)
"""
    Horoscope = """
Обери знак зодіаку інформацію на сьогодні про якого ти хочеш дізнатися.
"""
    PremiumRecipes = """
Тут ти можеш обрати рецепт з відео інструкцією приготуваня. 
"""
    Recipes = """
Вітаю тебе в розділі <b>Рецепти</b> тут ти можеш обрати будь-який рецепт на будь-яку годину дня.
"""
    Games = """
games
"""
    Support = """
support
"""
    Reminder = """
Вітаю тебе в розділі <b>Нагадування</b> тут ти можеш створити собі нагадування що б нічого не забути.
"""
    Tarological = """
Вітаю тебе в розділі <b>Щось тарологічне</b> тут ти можеш ближче познайомитися з магією зірочок, таких як і ти :)
"""
    GoodMood = """
good_mood
"""
    Jokes = """
Вітаю тебе в розділі <b>Приколяхи</b> тут ти є багато корисних функцій.\n
<i>(Працює тільки "Щось тарологічне", "Рецепти", "Нагадування")</i>
"""
    MatrixDestiny = """
Обери варіант розрахунку матриці.
"""
    StartText = """
Привіт, це <b>основне меню бота</b>, тут ти можеш обрати розділ. (Працює тільки "Приколяхи")\n
Також хотів би поділитися історією створення цього бота, тому ось:<a href="https://example.com"> Історія</a>
"""